In [2]:
import pandas as pd

In [3]:
# reading the csv file
df = pd.read_csv('customer.csv')
df

   Unnamed: 0  ID         Name  Age      City  Purchase_Amount
0           0   1   Customer_1   44   Chicago           175.08
1           1   2   Customer_2   53  New York           301.74
2           2   3   Customer_3   25   Houston           353.85
3           3   4   Customer_4   26   Phoenix           735.50
4           4   5   Customer_5   47   Houston           219.66
5           5   6   Customer_6   69   Houston           837.42
6           6   7   Customer_7   36   Phoenix           681.78
7           7   8   Customer_8   44   Houston           926.90
8           8   9   Customer_9   52   Houston           525.23
9           9  10  Customer_10   40  New York           471.29

# **Selecting one column**

### **Syntax 1**

In [5]:
# Select a column with []
df['Name']

0     Customer_1
1     Customer_2
2     Customer_3
3     Customer_4
4     Customer_5
5     Customer_6
6     Customer_7
7     Customer_8
8     Customer_9
9    Customer_10
Name: Name, dtype: object

In [6]:
# Check out the data type of a column
type(df['Name'])

pandas.core.series.Series

In [7]:
type(df)

pandas.core.frame.DataFrame

In [10]:
# Series: attributes & method
df['Name'].index
df['Name'].head()

0    Customer_1
1    Customer_2
2    Customer_3
3    Customer_4
4    Customer_5
Name: Name, dtype: object

In [14]:
# Changing value of Series
df['Name'][0] = 'New_Customer'

C:\Users\DELL\AppData\Local\Temp\ipykernel_9624\494527206.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Name'][0] = 'New_Customer'

In [12]:
df['Name']

0    New_Customer
1      Customer_2
2      Customer_3
3      Customer_4
4      Customer_5
5      Customer_6
6      Customer_7
7      Customer_8
8      Customer_9
9     Customer_10
Name: Name, dtype: object

In [13]:
df

   Unnamed: 0  ID          Name  Age      City  Purchase_Amount
0           0   1  New_Customer   44   Chicago           175.08
1           1   2    Customer_2   53  New York           301.74
2           2   3    Customer_3   25   Houston           353.85
3           3   4    Customer_4   26   Phoenix           735.50
4           4   5    Customer_5   47   Houston           219.66
5           5   6    Customer_6   69   Houston           837.42
6           6   7    Customer_7   36   Phoenix           681.78
7           7   8    Customer_8   44   Houston           926.90
8           8   9    Customer_9   52   Houston           525.23
9           9  10   Customer_10   40  New York           471.29

### **Syntax 2**

In [15]:
# Selecting a column using .
df.Purchase_Amount

0    175.08
1    301.74
2    353.85
3    735.50
4    219.66
5    837.42
6    681.78
7    926.90
8    525.23
9    471.29
Name: Purchase_Amount, dtype: float64

In [19]:
# (pitfalls)
df.Unnamed: 0

In [18]:
# Selecting the same column using .
df['Unnamed: 0']

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
Name: Unnamed: 0, dtype: int64